Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: After the end of this delay time all connected LSS devices will be using the new bitrate setting.
it_it: Al termine di questo ritardo, tutti i dispositivi LSS connessi utilizzeranno la nuova impostazione del bitrate.

source: After the first two items are enabled, you can open VSCode directly by right-clicking files or directories, which can improve the subsequent user experience.
it_it: Dopo aver abilitato i primi due elementi, è possibile aprire VSCode direttamente cliccando con il pulsante destro del mouse su file o directory, il che può migliorare l'esperienza utente successiva.

source: After the flashing is successful, open the serial terminal, enter the command, and press enter to run:
it_it: Dopo il flashing, aprire il terminale seriale, inserire il comando e premere Enter per eseguirlo:

source: After the profile recording has finished you can scroll through the profile graph using the scroll bar below it.
it_it: Al termine della registrazione del profilo, è possibile scorrere il grafico del profilo utilizzando la barra di scorrimento sottostante.

source: After the third item is enabled, you can select VSCode directly when you choose how to open it
it_it: Dopo aver abilitato la terza voce, si può selezionare VSCode direttamente quando si sceglie come aprirlo.

source: After these parameters have been entered, click the Start button to start the StallGuard profile recording.
it_it: Dopo aver inserito questi parametri, cliccare sul pulsante Start per avviare la registrazione del profilo StallGuard.

source: After you have entered the data click the Send button to send it to the chip.
it_it: Dopo aver inserito i dati, fare clic sul pulsante Send per inviarli al chip.

source: Again, this will not change the bitrate used by the TMCL-IDE.
it_it: Anche in questo caso, il bitrate utilizzato da TMCL-IDE non verrà modificato.

source: All CAN interfaces that are supported by the TMCL-IDE can also be used for CANopen connections.
it_it: Tutte le interfacce CAN supportate da TMCL-IDE possono essere utilizzate anche per le connessioni CANopen.

source: All RPDOs are shown in the PDO Selector area on the left hand side of the window.
it_it: Tutti gli RPDO vengono visualizzati nell'area PDO Selector sul lato sinistro della finestra.

source: All commands that are directly put through to the modules have an additional module index parameter.
it_it: Tutti i comandi che vengono inoltrati direttamente ai moduli hanno un "module index parameter" aggiuntivo.

source: All connected devices that support fastscan and that are in unconfigured (LSS Waiting) state will be found and shown in the list of LSS devices.
it_it: Tutti i dispositivi connessi che supportano la scansione rapida e che si trovano nello stato non configurato (LSS in attesa) verranno trovati e visualizzati nell'elenco dei dispositivi LSS.

source: All global parameters will be restored to their factory default values, and also any TMCL program stored on the module will be erased.
it_it: Tutti i parametri globali verranno ripristinati ai valori di default di fabbrica e anche qualsiasi programma TMCL memorizzato sul modulo verrà cancellato.

source: All interfaces that are supported by SocketCAN
it_it: Tutte le interfacce supportate da SocketCAN

source: All modules are equipped with at least one of these interfaces.
it_it: Tutti i moduli sono dotati di almeno una di queste interfacce.

source: All modules that have been found will appear on the tree view on the left hand side of the main window.
it_it: Tutti i moduli trovati appariranno nella vista ad albero sul lato sinistro della finestra principale.

source: All necessary information according to the CiA-305 standard can be entered in the File Description and Device Commissioning section of this tab page.
it_it: Tutte le informazioni necessarie secondo lo standard CiA-305 possono essere inserite nelle sezioni File Description e Device Commissioning di questo tab.

source: All other CAN messages will be filtered out.
it_it: Tutti gli altri messaggi CAN verranno filtrati.

source: All other CANopen tools of the TMCL-IDE will not be usable in such a case.
it_it: In tal caso, tutti gli altri strumenti CANopen di TMCL-IDE non saranno utilizzabili.

source: All other TMCL commands are executed locally in the TMCL/PC interpreter.
it_it: Tutti gli altri comandi TMCL vengono eseguiti localmente nell'interprete TMCL/PC.

source: All parameters that are supported by the connected module are shown in a list together with their current settings.
it_it: Tutti i parametri supportati dal modulo collegato vengono visualizzati in un elenco insieme alle loro impostazioni correnti.

source: All resources in the document are provided with hyperlinks for easy download.
it_it: Tutte le risorse presenti nel documento sono fornite di link per un facile download.

source: All serial ports (regardless of RS485, RS232 or TTL level) are shown in the tree view on the left hand side of the main window.
it_it: Tutte le porte seriali (indipendentemente dal livello RS485, RS232 o TTL) sono visualizzate nella vista ad albero sul lato sinistro della finestra principale.

source: All settings that are necessary to use the StealthChop mode can be made in an interactive way using this tool.
it_it: Tutte le impostazioni necessarie per utilizzare la modalità StealthChop possono essere effettuate in modo interattivo utilizzando questo strumento.

source: All settings that can be made on the StallGuard2 tab and on the CoolStep tab are immediately represented as TMCL commands on the TMCL code tab.
it_it: Tutte le impostazioni che possono essere effettuate nel tab StallGuard2 e nel tab CoolStep vengono immediatamente rappresentate come comandi TMCL nella scheda Codice TMCL.

source: All supported CAN interfaces are shown in the tree view on the left hand side of the main window.
it_it: Tutte le interfacce CAN supportate sono visualizzate nella vista ad albero sul lato sinistro della finestra principale.

source: All supported CAN interfaces that are attached to the PC are shown in the tree view on the left hand side of the main window.
it_it: Tutte le interfacce CAN supportate collegate al PC sono visualizzate nella vista ad albero sul lato sinistro della finestra principale.

source: All the container tools can be found on the right hand side of the icon bar at the top of the main window.
it_it: Tutti gli strumenti contenitore si trovano sul lato destro della barra delle icone, nella parte superiore della finestra principale.

source: All these parameters are automatically stored permanently in the EEPROM of the module.
it_it: Tutti questi parametri vengono automaticamente memorizzati in modo permanente nella EEPROM del modulo.

source: All trademarks and brand names used are property of their respective owners.
it_it: Tutti i marchi e i nomi commerciali utilizzati sono di proprietà dei rispettivi titolari.

source: All writable registers are shown in a list which can either be sorted by the register addresses or chronological by the time of the last write to the registers.
it_it: Tutti i registri scrivibili vengono visualizzati in un elenco ordinabile in base agli indirizzi dei registri o cronologicamente in base all'ora dell'ultima scrittura nei registri.

source: Also older versions can be downloaded from there if needed.
it_it: Se necessario, è possibile scaricare anche versioni precedenti.

source: Also the single bits of the status-word are shown with their meanings.
it_it: Vengono inoltre visualizzati i singoli bit della word di stato con il loro significato.

source: Also the time interval between two regular reads of objects can be changed here.
it_it: Qui è anche possibile modificare l'intervallo di tempo tra due letture regolari degli oggetti.

source: Also, the object type can be selected.
it_it: È inoltre possibile selezionare il tipo di oggetto.

source: Always set the parameter <upper> to 0 when reading from registers of up to 32 bits width.
it_it: Impostare sempre il parametro <upper> a 0 quando si legge da registri con larghezza fino a 32 bit.

source: Always set the parameter <upper> to 0 when writing to registers of up to 32 bits width.
it_it: Impostare sempre il parametro <upper> su 0 quando si scrive su registri con larghezza fino a 32 bit.

source: Always try different velocities.
it_it: Provare sempre velocità diverse.

source: Always two or more profiles should be recorded and compared against each other in order to get a stable result.
it_it: È sempre necessario registrare due o più profili e confrontarli tra loro per ottenere un risultato stabile.

source: Always write to the lower 32 bits first with <upper> set to 0 and then write the upper 32 bits with <upper> set to 255.
it_it: Scrivere sempre prima i 32 bit inferiori con <upper> impostato a 0, quindi scrivere i 32 bit superiori con <upper> impostato a 255.

source: An INI file is used to store all settings and is located in home path shown.
it_it: Un file INI viene utilizzato per memorizzare tutte le impostazioni e si trova nel path home mostrato.

source: An assembler directive starts with the # sign, and the only directive is #include to include a file.
it_it: Una direttiva assembler inizia con il simbolo # e l'unica direttiva disponibile è #include per includere un file.

source: An useful item maybe Alias in case some identical modules are connected.
it_it: Una voce utile potrebbe essere Alias nel caso in cui siano connessi moduli identici.

source: Animate: This function automatically executes the TMCL/PC program step-by-step, so that the flow of the program can be seen.
it_it: Animate: Questa funzione esegue automaticamente il programma TMCL/PC passo dopo passo, in modo che sia possibile visualizzarne il flusso.

source: Animation Delay: Additional delay between two instructions when using the Animate function of the Debugger.
it_it: Animation Delay: Ritardo aggiuntivo tra due istruzioni quando si utilizza la funzione Animate del Debugger.

source: Animation delay: Additional delay between two instructions when using the Animate function.
it_it: Animation delay: Ritardo aggiuntivo tra due istruzioni quando si utilizza la funzione Animate.

source: Another viewing way: Go to Device Manager -> click "View" at the top -> "List Devices by Connection" -> select "ACPI x64 based computers" -> "PCI Express Root Complex" -> "Intel(R) USB 3.20 Scalable Host Controller - 1.20 (Microsoft)" (varies from computer to computer).
it_it: Altro modo di visualizzazione: >Andare in "Device Manager" -> cliccare su "View" in alto -> "List Devices by Connection" -> selezionare "ACPI x64 based computers" -> "PCI Express Root Complex" -> "Intel(R) USB 3.20 Scalable Host Controller - 1.20 (Microsoft)" (varia da computer a computer).

source: Answer:
it_it: Risposta:

source: Application 1: Use the I2C port of the product to turn on OLED.
it_it: Applicazione 1: Utilizzare la porta I2C del prodotto per accendere l'OLED.

source: Application 2: Use the SPI port of the product to turn on OLED.
it_it: Applicazione 2: Utilizzare la porta SPI del prodotto per accendere l'OLED.

source: Arcus Cosinus
it_it: Arcocoseno

source: Arcus Sinus
it_it: Arcoseno

source: Arcus Tangens
it_it: Arcotangente

source: Arcus cosinus hyperbolicus
it_it: Arco coseno iperbolico

source: Arcus sinus hyperbolicus
it_it: Arco seno iperbolico

source: Arcus tangens hyperbolicus
it_it: Arco tangente iperbolico

source: Arduino Board Managers Tutorial
it_it: Tutorial sui Board Manager Arduino

source: Arduino IDE Official download link
it_it: Link ufficiale per il download dell'IDE Arduino

source: Arduino IDE is an open source electronic prototyping platform, convenient and flexible, easy to get started.
it_it: Arduino IDE è una piattaforma di prototipazione elettronica open source, pratica e flessibile, facile da usare.

source: Arduino are suitable for beginners and non-professionals because they are easy to learn and quick to get started.
it_it: Arduino è adatto a principianti e non professionisti perché è facile da imparare e veloce da usare.

source: Arduino-esp32 download completed
it_it: Download Arduino-esp32 completato

source: As CAN interfaces from different manufacturers also have different programming interfaces, not all of them are supported by the TMCL-IDE.
it_it: Poiché le interfacce CAN di diversi produttori hanno anche interfacce di programmazione diverse, non tutte sono supportate da TMCL-IDE.

source: As all TRINAMIC modules that are equipped with a USB interface use the CDC class (communication device class) they will appear as virtual serial ports.
it_it: Poiché tutti i moduli TRINAMIC dotati di interfaccia USB utilizzano la classe CDC (classe di dispositivo di comunicazione), appariranno come porte seriali virtuali.

source: As all explanations are contained in the wizard itself the wizards are not described in detail here.
it_it: Poiché tutte le spiegazioni sono contenute nella procedura guidata stessa, i wizardnon vengono descritti in dettaglio qui.

source: As every module that supports TMCL also supports the direct mode this tool is provided for every connected TMCL module.
it_it: Poiché ogni modulo che supporta TMCL supporta anche la modalità diretta, questo tool è disponibile per ogni modulo TMCL connesso.

source: As it comes with the onboard automatic download circuit, it can be downloaded automatically without manual operation
it_it: Poiché è dotato di un circuito di download automatico integrato, può essere scaricato automaticamente senza operazioni manuali.

source: Assemble: Select Assemble from the TMCL/PC menu to assemble a file.
it_it: Assemble: Selezionare Assemble dal menù TMCL/PC per assemblare un file.

source: Assembler Directives
it_it: Direttive Assembler

source: Assembler and Debugger Options
it_it: Opzioni Assembler e Debugger

source: At the beginning of a TMCL/PC program, all connected modules and/or evaluation boards that are to be controlled by the program have to be defined using module assignment commands.
it_it: All'inizio di un programma TMCL/PC, tutti i moduli e/o le evaluation board collegate che devono essere controllate dal programma devono essere definite utilizzando i comandi di assegnazione dei moduli.

source: At the same time, Arduino has a large global user community, providing an abundance of open source code, project examples and tutorials, as well as rich library resources, encapsulating complex functions, allowing developers to quickly implement various functions.
it_it: Allo stesso tempo, Arduino vanta un'ampia comunità di utenti globale, che fornisce un'abbondanza di codice open source, esempi di progetti e tutorial, oltre a una ricca libreria di risorse che incapsula funzioni complesse, consentendo agli sviluppatori di implementare rapidamente diverse funzionalità.

source: Auto Start Mode
it_it: Modalità Auto Start

source: Automatic Y scaling: Selects automatic Y scaling (default setting).
it_it: Automatic Y scaling: Seleziona la scala Y automatica (il default).

source: Automatically append a STOP command: If this option is selected the assembler automatically appends a Stop command at the end of every TMCL program (if the last command in the program is not already a STOP command).
it_it: Automatically append a STOP command: Se questa opzione è selezionata, l'assembler aggiunge automaticamente un comando Stop alla fine di ogni programma TMCL (se l'ultimo comando del programma non è già un comando STOP).

source: Automatically append a STOP command: If this option is selected the assembler automatically appends a Stop command at the end of every TMCL/PC program (if the last command in the program is not already a STOP command).
it_it: Automatically append a STOP command: Se questa opzione è selezionata, l'assembler aggiunge automaticamente un comando Stop alla fine di ogni programma TMCL/PC (se l'ultimo comando del programma non è già un comando STOP).

source: BOOT button
it_it: Pulsante BOOT

source: Backlight enable pin
it_it: Pin di abilitazione retroilluminazione

source: Basic Description
it_it: Descrizione di Base

source: Basic parameters
it_it: Parametri di base

source: Baudrate: Choose the baud rate of the serial port here.
it_it: Baudrate: Selezionare qui la velocità in baud della porta seriale.

source: Because of vibration the load value is often un-predictable and so not usable to achieve good results when using stall detection.
it_it: A causa delle vibrazioni, il valore del carico è spesso imprevedibile e quindi non utilizzabile per ottenere buoni risultati quando si utilizza il rilevamento dello stallo.

source: Before compilation, ESP32 and LVGL need to be configured through menuconfig:
it_it: Prima della compilazione, ESP32 e LVGL devono essere configurati tramite menuconfig:

source: Before executing a program please make sure that all motion control modules that are used by the program are connected and powered.
it_it: Prima di eseguire un programma, assicurarsi che tutti i moduli di controllo del movimento utilizzati dal programma siano collegati e alimentati.

source: Before operating, it is recommended to browse the table of contents to quickly understand the document structure.
it_it: Prima di iniziare, si consiglia di consultare l'indice per comprendere rapidamente la struttura del documento.

source: Before performing the PI tuning, it is important that the sensor connected is configured correctly.
it_it: Prima di eseguire l'ottimizzazione PI, è importante che il sensore collegato sia configurato correttamente.

source: Before running the program, refer to Arduino library manager tutorial for library installation
it_it: Prima di eseguire il programma, consultare il tutorial sul library manager Arduino per l'installazione della libreria.

source: Beginners should leave this option switched on (default setting), while experts might want to switch it off.
it_it: I principianti dovrebbero lasciare questa opzione attivata (impostazione predefinita), mentre gli esperti potrebbero volerla disattivare.

source: Beginners should leave this option switched on (default setting), while experts might want to turn it off.
it_it: I principianti dovrebbero lasciare questa opzione attivata (impostazione di default), mentre gli esperti potrebbero volerla disattivare.

source: Beside the RPDO list, all communication settings of the selected RPDO are shown and can be changed:
it_it: Accanto all'elenco RPDO, vengono visualizzate tutte le impostazioni di comunicazione dell'RPDO selezionato, che possono essere modificate:

source: Beside the TPDO list, all communication settings of the selected TPDO are shown and can be changed:
it_it: Accanto all'elenco dei TPDO, vengono visualizzate tutte le impostazioni di comunicazione del TPDO selezionato, che possono essere modificate:

source: Binary Value =%1010101
it_it: Valore Binario =%1010101

source: Bitrate: Select the desired CAN bit rate here.
it_it: Bitrate: Selezionare qui il bitrate CAN desiderato.

source: Block Circular Values: This function prevents values that are polled by the tools using the timer from being displayed in the TMCL Log window.
it_it: Block Circular Values: Questa funzione impedisce che i valori interrogati dagli strumenti tramite il timer vengano visualizzati nella finestra TMCL Log.

source: Block Traced Values: This function prevents values that are regularly traced by the tools from being displayed in the TMCL Log window.
it_it: Block Traced Values: Questa funzione impedisce che i valori tracciati regolarmente dagli strumenti vengano visualizzati nella finestra TMCL Log.

source: Block non-CANopen COB-IDs: When checked, all CAN messages with a COB-ID that does not belong to the CANopen standard COB-ID set will not be shown in the log window and will also not be further processed by the CANopen tools.
it_it: Block non-CANopen COB-IDs: Se selezionata, tutti i messaggi CAN con un COB-ID che non appartiene al set di COB-ID standard CANopen non verranno visualizzati nella finestra di registro e non verranno ulteriormente elaborati dagli strumenti CANopen.

source: Block trace/polling messages: Some tools in TMCM-CANopen use polling of specific objects by SDO on a regular base.
it_it: Block trace/polling messages: Alcuni tool in TMCM-CANopen utilizzano regolarmente il polling di oggetti specifici tramite SDO.

source: Blue 3rd place
it_it: Blu 3° posto

source: Blue 4th place
it_it: Blu 4° posto

source: Blue 5th place
it_it: Blu 5° posto

source: Blue 6th place
it_it: Blue 6° posto

source: Blue 7th place
it_it: Blu 7° posto

source: Board installation requirement
it_it: Requisiti per l'installazione della board

source: Board name
it_it: Nome della Board

source: Bold points: Selects if each data point of the graph shall be displayed as a bold point or just as a small point.
it_it: Bold points: Seleziona se ogni punto dati del grafico deve essere visualizzato come un punto in grassetto o semplicemente come un punto piccolo.

source: Both P and I parameters are turned to 0 and the P parameter is increased such that the actual flux reaches 70% of the desired target flux.
it_it: Entrambi i parametri P e I vengono impostati a 0 e il parametro P viene aumentato in modo che il flusso effettivo raggiunga il 70% del flusso target desiderato.

source: Both bars are not moveable.
it_it: Entrambe le barre non sono mobili.

source: Brake chopper: If supported by the module, settings for an optional brake resistor can be made here.
it_it: Brake chopper: Se supportato dal modulo, qui è possibile impostare una resistenza di frenatura opzionale.

source: Breakpoints
it_it: Breakpoint

source: Breakpoints can be set or removed by clicking the appropriate line on the left breakpoint bar of the editor.
it_it: I "Breakpoint" possono essere impostati o rimossi cliccando sulla riga appropriata sulla barra dei breakpoint a sinistra dell'editor.

source: Built-in 512KB SRAM and 384KB ROM, with onboard 16MB Flash and 8MB PSRAM
it_it: 512 KB di SRAM e 384 KB di ROM integrate, con 16 MB di Flash e 8 MB di PSRAM integrati

source: But also RS485, RS232 or CAN can be used to connect the module.
it_it: Ma anche RS485, RS232 o CAN possono essere utilizzate per collegare il modulo.

source: But be careful, as with a too low timeout setting some unconfigured LSS devices might not be found.
it_it: Attenzione, però, perché con un timeout troppo basso alcuni dispositivi LSS non configurati potrebbero non essere trovati.

source: But in contrast to the Parameter Display, it does not only display the contents of selected TMCL axis parameters and user variables, but also allows changing the values of the displayed parameters.
it_it: Ma a differenza di quest'ultimo, non si limita a visualizzare il contenuto dei parametri degli assi TMCL selezionati e delle variabili utente, ma consente anche di modificare i valori dei parametri visualizzati.

source: By checking whether there is data available at the serial port, if there is data, it reads a byte and sends it back immediately, so that the received 485 data can be sent back intact
it_it: Verificando la presenza di dati sulla porta seriale, se presenti, legge un byte e lo invia immediatamente, in modo che i dati 485 ricevuti possano essere restituiti intatti.

source: By checking whether there is data available at the serial port, if there is data, it reads a byte and sends it back immediately, so that the received UART data can be sent back intact
it_it: Verificando se ci sono dati disponibili sulla porta seriale, legge un byte e lo invia immediatamente, in modo che i dati UART ricevuti possano essere inviati intatti.

source: By default this is set to 5ms, but can be set lower or higher if needed.
it_it: Per default, questo valore è impostato su 5 ms, ma può essere impostato su un valore inferiore o superiore, se necessario.
